DocumentJournals/ЗаявкиКабинетСотрудника/ЗаявкиКабинетСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DocumentJournal>
  <name>ЗаявкиКабинетСотрудника</name>
  <registeredDocuments>Document.ЗаявкаОтпускКабинетСотрудника</registeredDocuments>
  <registeredDocuments>Document.ЗаявкаОтпускБезОплатыКабинетСотрудника</registeredDocuments>
  <registeredDocuments>Document.ЗаявкаПрежняяВерсияКабинетСотрудника</registeredDocuments>
  <registeredDocuments>Document.ОбращениеКабинетСотрудника</registeredDocuments>
  <registeredDocuments>Document.ЗаявкаСправка2НДФЛКабинетСотрудника</registeredDocuments>
  <registeredDocuments>Document.ЗаявкаОтсутствиеКабинетСотрудника</registeredDocuments>
  <registeredDocuments>Document.ЗаявкаНалоговыеВычетыКабинетСотрудника</registeredDocuments>
  <registeredDocuments>Document.ЗаявкаИзменениеЛичныхДанныхКабинетСотрудника</registeredDocuments>
  <registeredDocuments>Document.ЗаявкаСоциальноеПособиеКабинетСотрудника</registeredDocuments>
  <columns>
    <name>Организация</name>
  </columns>
  <columns>
    <name>Сотрудник</name>
  </columns>
  <columns>
    <name>ДатаСоздания</name>
  </columns>
  <columns>
    <name>СрокИсполнения</name>
  </columns>
  <columns>
    <name>РезультатВыполнения</name>
  </columns>
  <columns>
    <name>Выполнена</name>
  </columns>
  <columns>
    <name>ТипЗаявки</name>
  </columns>
  <columns>
    <name>Комментарий</name>
  </columns>
</mdclass:DocumentJournal>

Enums/ТипыЗаявокКабинетСотрудника/ТипыЗаявокКабинетСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗаявокКабинетСотрудника</name>
  <enumValues>
    <name>СправкаНДФЛ</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНаКомпенсациюОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеЛичныхДанных</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНаУдержаниеДСВ</name>
  </enumValues>
  <enumValues>
    <name>СправкаСМестаРаботы</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНаОтпуск</name>
  </enumValues>
  <enumValues>
    <name>СправкаОбОстаткеОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНаНалоговыеВычеты</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеОтсутствия</name>
  </enumValues>
  <enumValues>
    <name>ОбращениеСотрудника</name>
  </enumValues>
  <enumValues>
    <name>Отпуск</name>
  </enumValues>
  <enumValues>
    <name>ОтпускБезОплаты</name>
  </enumValues>
  <enumValues>
    <name>УчебныйОтпуск</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияОтпуска</name>
  </enumValues>
  <enumValues>
    <name>Болезнь</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоБеременностиИРодам</name>
  </enumValues>
  <enumValues>
    <name>ОпозданиеЛичныеДела</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоУходуЗаРебенком</name>
  </enumValues>
  <enumValues>
    <name>Отгул</name>
  </enumValues>
  <enumValues>
    <name>Командировка</name>
  </enumValues>
  <enumValues>
    <name>ДниУходаЗаДетьмиИнвалидами</name>
  </enumValues>
  <enumValues>
    <name>ПособиеПриРожденииРебенка</name>
  </enumValues>
  <enumValues>
    <name>ЕжемесячноеПособиеПоУходуЗаРебенком</name>
  </enumValues>
  <enumValues>
    <name>ВозвратИзОтпускаПоУходуЗаРебенком</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОбИтогахКомандировки</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОРасходахВКомандировке</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеГрафикаОтпусков</name>
  </enumValues>
  <enumValues>
    <name>ИсполнениеГособязанностей</name>
  </enumValues>
</mdclass:Enum>

DocumentJournals/ЗаявкиКабинетСотрудника/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЧтениеОбъектаРазрешено(Ссылка)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ТипыЗаявокДляВыбора() Экспорт

	ТипЗаявкиМенеджер = Перечисления.ТипыЗаявокКабинетСотрудника;
	
	ТипыЗаявок = Новый Массив;
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.Отпуск);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ОтпускБезОплаты);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.УчебныйОтпуск);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.КомпенсацияОтпуска);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ЗаявлениеНаНалоговыеВычеты);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.СправкаНДФЛ);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.Болезнь);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ОтпускПоБеременностиИРодам);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ИзменениеЛичныхДанных);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ОбращениеСотрудника);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ЗаявлениеНаУдержаниеДСВ);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.СправкаСМестаРаботы);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.СправкаОбОстаткеОтпуска);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ОпозданиеЛичныеДела);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ОтпускПоУходуЗаРебенком);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.Отгул);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.Командировка);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ДниУходаЗаДетьмиИнвалидами);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ПособиеПриРожденииРебенка);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ЕжемесячноеПособиеПоУходуЗаРебенком);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ВозвратИзОтпускаПоУходуЗаРебенком);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ИзменениеГрафикаОтпусков);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ИсполнениеГособязанностей);
	
	Возврат ТипыЗаявок;

КонецФункции

#КонецОбласти

#КонецЕсли
